// シップ名ブレンド関連

bslist = [
	[[0],
		["旅人","ニューター","コグニート","エルモニー","パンデモス","","",""],
		[""," オブ ","なる","の","","","",""]
	],
	[[30],
		["剣士","剣","士","刀剣","鎌","斧","ナイフ",""],
		["セイバー","セイ","バー","アックス","サイス","ソード","ソードマン",""],
		["ブレードマスター","ブレード","マスター","ヴァルキリー","戦乙女","","",""]
	],
	[[39],
		["キッカー","キック","蹴り","脚","","","",""],
		["ハイキッカー","ハイ","ストライカー","","","","",""],
		["ムーンシューター","ムーン","シューター","の","トルネード","月","月の",""]
	],
	[[40],
		["ワイルドマン","ワイルド","マン","戦技","戦闘","技術","バトル",""],
		["バーバリアン","バーバリ","アン","蛮族","","","",""],
		["バーサーカー","バー","サー","カー","ベルセルク","狂戦士","戦乙女",""]
	],
	[[35],
		["ガーズマン","ガーズ","マン","盾","シールド","ガード","",""],
		["ディフェンダー","カミカゼ","","","","","",""],
		["ガーディアン","ガー","ディアン","の","守護者","真","真の",""]
	],
	[[31],
		["メイサー","メイ","サー","こんぼう","","","",""],
		["クラッシャー","ハンマー","鉄槌","","","","",""],
		["デストロイヤー","デストロイ","ヤー","クウェイカー","","","",""]
	],
	[[29],
		["パンチャー","素手","","","","","",""],
		["ボクサー","サー","ナックル","ボク","","","",""],
		["フィストマスター","フィスト","マスター","拳","","","",""]
	],
	[[33],
		["ガンナー","ガン","ナー","銃器","ハンター","銃","",""],
		["バレッティア","大砲","砲","","","","",""],
		["イーストウッド","イースト","ウッド","キャノン","","","",""]
	],
	[[38],
		["レンジャー","レン","ジャー","猟兵","","","",""],
		["罠師","罠","師","トラップ","","","",""],
		["仕事人","仕事","人","策士","","","",""]
	],
	[[42],
		["物まね師","物まね","物","キャット","コピー","コピーキャット","猫",""],
		["道化師","道","化","師","まね","道化","クラウン",""],
		["道化王","王","女王","キング","クイーン","ピエロ","",""]
	],
	[[36],
		["投げ士","投げ","士","スロウ","","","",""],
		["スマッシャー","エース","剛腕","速球","","","",""],
		["ドリームフィールダー","ドリーム","フィールダー","の","夢","夢の","豪速球",""]
	],
	[[34],
		["アーチャー","弓","ハンター","狩人","","","",""],
		["スナイパー","スナ","イパー","狙撃手","","","",""],
		["ホークアイ","ホーク","アイ","の","鷹","鷹の目","目",""]
	],
	[[43],
		["テイマー","調教","アニマル","サル","トレーナー","ネズミ","バット",""],
		["ハイ テイマー","ハイ","クマ","シカ","バイソン","ビーク","犬",""],
		["マスター テイマー","マスター","ウルフ","トラ","バルドス","モール","ライオン",""]
	],
	[[51],
		["野生児","野生","児","ワイルドボーイ","少年","少女","娘",""],
		["ピース バイバー","ピース","バイバー","自然","調和","サイレント","沈黙",""],
		["ジャングルマスター","ジャングル","マスター","ネイチャー","","","",""]
	],
	[[32],
		["ランサー","ラン","サー","槍","突き","","",""],
		["ジャベリンナイト","ジャベリン","ナイト","疾風","","","",""],
		["ドラゴンスレイヤー","ドラゴン","スレイヤー","ドラ","ゴン","竜槍","",""]
	],
	[[50],
		["魔術師","魔術","魔","術","魔熟","魔法","熟練",""],
		["幻術師","幻術","幻","イリュージョン","","","",""],
		["幻術王","王","女王","キング","クイーン","ビジョン","",""]
	],
	[[44],
		["ウィザード","ウィ","ザード","ウィッチ","ッチ","魔法使い","魔女",""],
		["メイジ","破壊","魔法","炎の","土の","氷の","風の",""],
		["アークメイジ","アーク","フレア","メテオ","無の","雷撃の","",""]
	],
	[[45],
		["プリースト","プリ","スト","ー","回復","魔法","ヒーラー",""],
		["ハイ プリースト","ハイ","キュア","ヒール","神官","","",""],
		["プリースト ロード","ロード","ディバイン","リザレクション","司祭","","",""]
	],
	[[46],
		["シャーマン","シャー","マン","強化","魔法","","",""],
		["ハイ シャーマン","ハイ","インヴィジ","巫女","","","",""],
		["シャーマン ロード","ロード","エレメンタル","プロテクション","","","",""]
	],
	[[47],
		["エンチャンター","エン","チャン","ター","神秘","魔法","リコーラー",""],
		["ハイ エンチャンター","ハイ","マジックブレイド","マジック","ブレイド","巫女","マジ",""],
		["エンチャント ロード","エンチャント","ロード","アルター","テレポーター","","",""]
	],
	[[48],
		["サモナー","サ","モナー","召喚","魔法","召喚士","",""],
		["ハイ サモナー","ハイ","スカルパス","骨","","","",""],
		["サモン ロード","サモン","モン","ロード","クイーン","マブ","使徒",""]
	],
	[[49],
		["シャドウ","死魔","死の","魔法","","","",""],
		["リーパー","リー","パー","ロットン","","","",""],
		["ジョーカー","ジョー","カー","ソウルレスキュー","パニッシャー","","",""]
	],
	[[37],
		["ブラッド サッカー","ブラッド","サッカー","牙","バイト","","",""],
		["ヴァンパイア","ヴァン","パイア","バット","","","",""],
		["ヴァンパイアロード","ロード","ファング","吸血鬼","","","",""]
	],
	[[41],
		["ドリンカー","ドリン","カー","酩酊","","","",""],
		["大酒飲み","大","酒","飲み","酒飲み","酔っぱらい","",""],
		["ちゃぶ台返し","ちゃぶ台","返し","リバース","ザル","","",""]
	],
	[[52],
		["小悪魔","小","悪","魔","悪魔","暗黒","命令",""],
		["デーモン","デー","モン","デビル","宣告者","","",""],
		["デーモン ロード","ロード","サタン","ダーク","ダークネス","","",""]
	],
	[[20],
		["鍛冶師","鍛冶","師","屋","金属","","",""],
		["メタルワーカー","メタル","ワーカー","ワー","カー","武器","防具",""],
		["メタルマスター","マスター","スミス","","","","",""]
	],
	[[22],
		["木工師","木工","木","工","師","ウッドゥン","屋",""],
		["大工師","大工","大","セードロ","","","",""],
		["親方","親","方","トレント","","","",""]
	],
	[[23],
		["仕立て屋","仕立て","屋","仕","立て","裁縫","",""],
		["着付け師","着付け","師","クロース","","","",""],
		["ブランド デザイナー","ブランド","デザイナー","シルク","レザー","","",""]
	],
	[[24],
		["調合師","調合","調","合","師","薬調合","屋",""],
		["秘薬師","秘薬","秘","薬","スタミナ","ヒーリング","ポーション",""],
		["魔医師","魔","医","医師","テレポート","ドクター","リザレクト",""]
	],
	[[25],
		["細工師","細工","細","工","師","装飾","屋",""],
		["宝石師","宝石","宝","石","イヤリング","リング","",""],
		["ジュエル マスター","ジュエル","マスター","眼鏡","","","",""]
	],
	[[19],
		["料理師","料理","師","フライパン","屋","料理人","キッチン",""],
		["シェフ","パティシエ","包丁","パン","肉","","",""],
		["マスター シェフ","マスター","コック","","","","",""]
	],
	[[21],
		["バーテンダー","バー","テンダー","ジュース","屋","","",""],
		["醸造師","醸造","醸","造","師","ミルク","ワイン",""],
		["醸造王","王","女王","カクテル","キング","クイーン","",""]
	],
	[[26],
		["筆記師","筆記","筆","記","師","複製","屋",""],
		["贋作師","贋作","贋","作","ノアピース","秘伝の書","",""],
		["フェイク ロード","フェイク","ロード","奥義","究極","","",""]
	],
	[[16],
		["耕作師","耕作","耕","作","師","収穫","果物",""],
		["農夫","農","夫","キノコ","野菜","苺","",""],
		["農場主","場","主","花","海産物","","",""]
	],
	[[17],
		["釣り人","釣り","人","フィッシャーマン","魚","太公望","",""],
		["釣り師","師","エイ","サメ","バス","マグロ","漁師",""],
		["名人釣り師","名人","名","イカ","ウンディーネ","タコ","",""]
	],
	[[14],
		["マイナー","マイ","ナー","採掘","アイアン","カッパー","ブロンズ",""],
		["ゴールドマイナー","ゴールド","シルバー","スチール","","","",""],
		["マイン ロード","マイン","ロード","オリハルコン","ミスリル","","",""]
	],
	[[15],
		["木こり","木","こり","若木","大木","","",""],
		["伐採師","伐採","伐","採","師","ゴム","巨木",""],
		["ランバー ロード","ランバー","ロード","竹","","","",""]
	],
	[[9],
		["フォールマン","フォール","マン","落下","耐性","","",""],
		["スカイダイバー","スカイ","ダイバー","階段","橋","","",""],
		["フォーリングロード","フォーリング","フォー","リング","ロード","天空","墜",""]
	],
	[[10],
		["スイマー","水泳","","","","","",""],
		["ライフガード","ライフ","ガード","潜水","潜水士","","",""],
		["サブマリン","サブ","マリン","カッパ","","","",""]
	],
	[[11],
		["デッドマン","デッド","マン","死体","回収","","",""],
		["スカベンジャー","魂","幽体","離脱","おばけ","","",""],
		["ルート マスター","ルート","マスター","ゴースト","","","",""]
	],
	[[12],
		["ヘルパー","ヘル","パー","包帯","バンデージ","慈愛の","",""],
		["メディック","ナース","看護","","","","",""],
		["ジェネラル メディック","ジェネラル","天使","聖人","聖女","","",""]
	],
	[[53],
		["ベンダー","取引","ショップ","屋","","","",""],
		["商人","商","人","商店","","","",""],
		["豪商","豪","商会","","","","",""]
	],
	[[55],
		["ソングシンガー","ソング","シンガー","音楽","歌","歌手","楽器演奏",""],
		["バード","吟遊詩人","詩人","奏者","","","",""],
		["聖歌隊長","聖","隊","隊長","歌姫","姫","プリンセス",""],
	],
	[[28],
		["調髪師","調髪","調","髪","美容","見習い","美容師",""],
		["化粧師","化粧","化","粧","美容院","の美容院","",""],
		["カリスマ美容師","カリスマ","ビューティサロン","メイクアップアーティスト","","","",""]
	],
	[[56],
		["スリ","盗み","スナッチャー","","","","",""],
		["ひったくり","ひった","くり","シーフ","","","",""],
		["泥棒","泥","棒","怪盗","ファントム","泥棒猫","猫",""]
	],
	[[59],
		["ストリートダンサー","ストリート","ダンサー","ダン","サー","ダンス","バック",""],
		["バニーダンサー","バニー","スワン","踊り子","舞手","","",""],
		["スターダンサー","スター","エトワール","姫","舞","舞姫","プリンセス",""]
	],
	[[58],
		["目立ちたがり","目立ち","たがり","パフォーマンス","パフォーマー","","",""],
		["大道芸人","大","道","芸","人","コメディアン","",""],
		["芸人","エンターテイナー","","","","","",""]
	],
	[[18],
		["解読者","解読","者","物知り","","","",""],
		["探求者","探求","知識","","","","",""],
		["博識家","博識","家","シーカー","","","",""]
	],
	[[13],
		["休憩人","休憩","座る人","人","凄い","凄い肉体","肉体",""],
		["瞑想師","ボディ","屈強","屈強ボディ","座り続ける人","師","瞑想",""],
		["瞑想マスター","ナイス","椅子","ナイスバディ","バディ","マスター","",""]
	],
	[[54],
		["ロックシンガー","ロック","シンガー","ビジュアル","騒音","","",""],
		["ハード ロッカー","ハード","ロッカー","パンク","！","","",""],
		["メタル シンガー","メタル","へヴィ","","","","",""]
	],

// 複合
	[[30,35,39,40],
		["ウォーリアー","ウォー","リア","戦","戦士","","",""],
		["ファイター","ファ","イター","闘","闘士","","",""],
		["ナイト","騎士","","","","","",""]
	],
	[[44,45,46,47],
		["アルケミスト","アルケ","ミスト","錬金術師","","","",""],
		["マスター ウィザード","マスター","ウィザード","魔術師","","","",""],
		["ウォーロック","ウォー","ロック","魔道士","","","",""]
	],
	[[34,51,42,43],
		["フォレスター","フォレ","スター","の","監視者","森","森の",""],
		["フォレスト マスター","スト","マスター","春風","朝霧","番人","",""],
		["スカイウォーカー","スカイ","ウォーカー","星渡り","","","",""]
	],
	[[48,49,37,52],
		["ネクロマンサー","ネクロ","マンサー","ネク","ロマン","呪術師","",""],
		["ダーク プリースト","ダーク","プリ","スト","ー","妖術師","",""],
		["シャドウ ナイト","ナイト","暗黒","騎士","","","",""]
	],
	[[20,22,15,14],
		["クリエイター","職人","","","","","",""],
		["マスター クリエイター","名工","","","","","",""],
		["ジェネシス","ジェネ","シス","創造主","","","",""]
	],
	[[38,51,5,42],
		["爆弾男","爆弾","男","爆弾女","女","","",""],
		["超爆弾男","超","爆","弾","超爆弾女","","",""],
		["ボンバーキング","ボンバー","キング","ボンバークイーン","クイーン","王","女王",""],
	],
	[[47,45,40,31,7],
		["テンプルナイト","テンプル","ナイト","修道","修道騎士","","",""],
		["パラディン","聖","聖騎士","","","","",""],
		["セイクリッドロード","セイクリッド","神聖","神聖騎士","","","",""]
	],
	[[51,45,50,52],
		["ドルイド","ドル","イド","の","守り人","大樹","大樹の",""],
		["マスター ドルイド","樹","聖","聖樹","聖樹の","","",""],
		["ドルイド キング","ドルイド クイーン","クイーン","女王","王","","",""]
	],
	[[44,45,46,47,48,49],
		["紺碧の賢者","紺碧","の","賢者","セルリアン","ワイズマン","賢人",""],
		["深緋の賢者","深緋","クリムゾン","","","","",""],
		["白銀の賢者","白銀","全知全能","全知","全能","","",""]
	],
	[[30,37,11,49],
		["イビルナイト","イビル","ナイト","邪悪","騎士","","",""],
		["デスナイト","デス","死霊","","","","",""],
		["ヘルナイト","ヘル","ディアボロス","地獄","","","",""]
	],
	[[10,9,51,13],
		["アスリート","スポーツ","","","","","",""],
		["トライアスリート","トライ","パワフル","","","","",""],
		["鉄人","鉄","アイアンマン","","","","",""]
	],
	[[19,20,21,22,23,24,25,26],
		["グレート クリエイター","グレート","クリエイター","クリエイター","技巧","","",""],
		["クリエイト ロード","クリエイト","精巧","","","","",""],
		["人間国宝","人間","国宝","国","リビングトレジャー","神","神の手",""]
	],
	[[29,39,9,3,13,58],
		["荒くれ者","荒くれ","者","荒","くれ","獰猛","",""],
		["レスラー","レス","ラー","強者","","","",""],
		["チャンピオン","チャン","ピオン","チャンプ","王者","","",""]
	],
	[[33,38,42,40,19],
		["傭兵","傭","兵","マーシナリー","","","",""],
		["ヒットマン","ヒット","殺し屋","狙撃手","","","",""],
		["ゴッドファーザー","ゴッド","ファーザー","ドン","神父","","",""]
	],
	[[40,31,35,8,1],
		["ブレイブナイト","ブレイブ","ナイト","勇敢","","","",""],
		["アーマーナイト","アーマー","勇猛","","","","",""],
		["ジャスティス タンク","ジャスティス","タンク","正義の","鉄壁","壁","",""]
	],
	[[41,29,2,5,39],
		["酔拳士","酔","酔拳","拳士","ドランクモンキー","","",""],
		["酔拳マスター","酔酒","","","","","",""],
		["酔拳聖","拳聖","聖","酔仙","","","",""]
	],
	[[30,12,40,2,0,6],
		["サムライ","サム","ライ","侍","武士","武者","",""],
		["サムライ マスター","武将","","","","","",""],
		["将軍","将","軍","大将","","","",""]
	],
	[[47,50,48,20],
		["マイン ビショップ","マイン","ビショップ","ミステリーハンド","僧正","魔術工","",""],
		["メタル ビショップ","鉄腕の","鉄","腕","の","","",""],
		["フルメタル ビショップ","フルメタル","聖鋼の","聖","鋼","","",""]
	],
	[[19,21,8],
		["厨房師","厨房","厨","房","板前","","",""],
		["マスター厨房師","の","炎","炎の","立板","","",""],
		["ゴッド厨房師","ゴッド","3つ星","神","神の","花板","",""]
	],
	[[30,38,42,51,24,9,36],
		["アサシン","くの一","暗殺者","","","","",""],
		["忍者","忍","者","隠密","","","",""],
		["御庭番","御庭","御","庭","番","影","",""]
	],
	[[25,23,1,2,42,58],
		["コスプレイヤー","コスプレ","コス","プレイヤー","プレ","","",""],
		["コスプレヒーロー","ヒーロー","コスプレヒロイン","ヒロイン","ヒロ","イン","",""],
		["ヒーロー","マドンナ","気合い","主人公","熱血","勇気","",""]
	],
	[[10,16,41,9,11,58],
		["物好き","物","好き","奇人","","","",""],
		["ネタ師変人","ネタ師","ネタ","変人","ヘッポコ","歌舞伎者","",""],
		["神ネタ師","神","紳士","伝説","天才","ミラクル","ばいーん",""]
	],
	[[10,32,19,17,53],
		["海戦士","海","戦","士","戦士","海女","",""],
		["英雄海戦士","英雄","シーサーペント","ヒーロー","マーメイド","","",""],
		["海王","王","クラーケン","スキュラ","師匠","","",""]
	],
	[[53,19,51,43],
		["ブリーダー","イクシオン","オーク","グレイブン","コボルト","スプリガン","タルタロッサ",""],
		["ブリード マスター","アマゾネス","オルヴァン","グリフォン","ドラゴン","バルカー","リザードマン",""],
		["ブリード ロード","ロード","猫","ギガース","ゴーレム","タイタン","バジリスク",""]
	],
	[[54,5,37,55],
		["ブラッドバード","ブラッド","呪言","","","","",""],
		["ドレッドバード","ドレッド","狂気","","","","",""],
		["カオスバード","カオス","混沌","","","","",""]
	],
	[[31,53,56,41],
		["レディース","チンピラ","爆走","暴れん坊","","","",""],
		["アウトロー","アウト","ロー","無法者","","","",""],
		["ギャング","マフィア","","","","","",""]
	],
	[[59,55,10,58],
		["新人アイドル","新人","アイドル","の","期待","期待の","",""],
		["ビスクアイドル","ビスク","エルガディン","売れっ子","","","",""],
		["ダイアロスアイドル","ダイアロス","スーパー","みんなの","","","",""]
	],
	[[19,23,28],
		["ハウスキーパー","ハウス","キーパー","使用人","","","",""],
		["メイド","バレット","侍女","従者","","","",""],
		["アビゲイル","バトラー","執事","","","","",""]
	],
	[[36,42,56],
		["スパイ","斥候","","","","","",""],
		["ストーカー","スト","ー","カー","追跡","","",""],
		["ステルス","隠密","","","","","",""]
	],
	[[18,26,7,47,6],
		["アカデミアン","学士","","","","","",""],
		["ティーチャー","ティー","チャー","先生","","","",""],
		["プロフェッサー","プロ","フェッサー","教授","","","",""]
	],
	[[9,10,14,18,56],
		["アドベンチャー","アドベン","チャー","冒険家","冒険","","",""],
		["エクスプローラー","エクス","プローラー","探検家","探検","","",""],
		["トレジャーハンター","トレジャー","ハンター","ハン","ター","収集家","財宝",""]
	],
	[[32,0,1,13,54],
		["デュエリスト","闘士","","","","","",""],
		["レガトゥス","レガ","トゥス","司令","","","",""],
		["タイラント","タイ","ラント","暴君","","","",""]
	]
];

function setBS(p,q,r){
	for(i=0; i<3; i++)
		if(document.bship.bs_sel[i].checked){
			document.bship.bs_txt[i].value = bslist[p][q][r];
			if(p<50)
				sdata[i] = "abcdefghijklmnopqrstuvwx".charAt((q-1)*8+r) + "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ".charAt(p);
			if(p>=50)
				sdata[i] = "ABCDEFGHIJKLMNOPQRSTUVWX".charAt((q-1)*8+r) + "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ".charAt(p-50);
// alert(i + ": " + sdata[i]);
		}
	document.mcfrm.sname.value = document.bship.bs_txt[0].value + document.bship.bs_txt[1].value + document.bship.bs_txt[2].value;
}

function decodeBS(code){
// alert(code);
	tmp = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ".indexOf(code.charAt(0));
	tmp2 = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ".indexOf(code.charAt(1));

// alert("tmp: "+tmp+"; tmp2: "+tmp2);
	p = tmp2;
		if(tmp>=26) p += 50;
	q = Math.floor(tmp%26/8)+1;
	r = tmp%26%8;
// alert("p: "+p+"; q: "+q+"; r: "+r);
// alert(bslist[p][q][r]);
	return(bslist[p][q][r]);
}
function blendShip(){

	var bstable = "";

	bstable = "<div id='option3' style='background-color:#ccccdd; padding:10px 10px 10px 15px;'>"
		+ "<form name='bship'>"
		+ "<input class='chk' type='radio' name='bs_sel'><input type='text' name='bs_txt' readonly onclick='document.bship.bs_sel[0].checked=true' value='" + decodeBS(sdata[0]) + "'>"
		+ "<input class='chk' type='radio' name='bs_sel'><input type='text' name='bs_txt' readonly onclick='document.bship.bs_sel[1].checked=true' value='" + decodeBS(sdata[1]) + "'>"
		+ "<input class='chk' type='radio' name='bs_sel'><input type='text' name='bs_txt' readonly onclick='document.bship.bs_sel[2].checked=true' value='" + decodeBS(sdata[2]) + "'>"
		+ "　　　　"
		+ "<input class='chk' type='radio' name='bs_sel2' onclick='for(i=4;i<=bslist.length*3;i++) if(document.getElementById(&quot;dsp0_&quot;+i))document.getElementById(&quot;dsp0_&quot;+i).style.display=&quot;&quot;;' checked>全て"
		+ "<input class='chk' type='radio' name='bs_sel2' onclick='for(i=4;i<=bslist.length*3;i++) if(document.getElementById(&quot;dsp0_&quot;+i))document.getElementById(&quot;dsp0_&quot;+i).style.display=&quot;none&quot;;'>取得のみ"
		+ "</form>"
		+ "<div style='width:830px; height:540px; overflow-y:auto;'>";

	bstable += "<table cellpadding=5 cellspacing=1 bgcolor=#ffffff width=700>\n";
	bstable += "<tr id='dsp2'>\n<td class='bs2_1' onclick='setBS(0,1,0)' width=100 nowrap>旅人</td>\n";
	bstable += "<td class='bs2_1' onclick='setBS(0,1,1)' width=100 nowrap>ニューター</td>\n";
	bstable += "<td class='bs2_1' onclick='setBS(0,1,2)' width=100 nowrap>コグニート</td>\n";
	bstable += "<td class='bs2_1' onclick='setBS(0,1,3)' width=100 nowrap>エルモニー</td>\n";
	bstable += "<td class='bs2_1' onclick='setBS(0,1,4)' width=100 nowrap>パンデモス</td>\n";
	bstable += "<td class='bs0' onclick='setBS(0,1,5)' width=100 nowrap>&nbsp;</td>\n";
	bstable += "<td class='bs0' onclick='setBS(0,1,5)' width=100 nowrap>単語削除</td>\n";
	bstable += "</tr>\n";
	bstable += "<td class='bs0' onclick='setBS(0,1,5)' width=100 nowrap>&nbsp;</td>\n";
	bstable += "<td class='bs2_2' onclick='setBS(0,2,1)' width=100 nowrap>&nbsp;オブ&nbsp;</td>\n";
	bstable += "<td class='bs2_2' onclick='setBS(0,2,2)' width=100 nowrap>なる</td>\n";
	bstable += "<td class='bs2_2' onclick='setBS(0,2,3)' width=100 nowrap>の</td>\n";
	bstable += "<td class='bs0' onclick='setBS(0,1,5)' width=100 nowrap>&nbsp;</td>\n";
	bstable += "<td class='bs0' onclick='setBS(0,1,5)' width=100 nowrap>&nbsp;</td>\n";
	bstable += "<td class='bs0' onclick='setBS(0,1,5)' width=100 nowrap>&nbsp;</td>\n";
	bstable += "</tr>\n";

	for(i=1; i<bslist.length; i++){
		var f=3;
		if(bslist[i][0].length == 1){
			f= Math.floor( pdata[ bslist[i][0][0] ] / 300000 );
		}else{
			var f=3;
			for(j=0;j<bslist[i][0].length;j++){
				if(f>2 && pdata[ bslist[i][0][j] ] < 900000 )
					f=2;
				if(f>1 && pdata[ bslist[i][0][j] ] < 700000 )
					f=1;
				if(f>0 && pdata[ bslist[i][0][j] ] < 400000 ){
					f=0;
				}
			}
		}
		for(j=1; j<4; j++){
			tmp = "dsp0";
			tmp2 = "bs1_";
			if(f>0 && j<=f){
				tmp = "dsp1";
				tmp2 = "bs2_";
			}
			bstable += "<tr id='" + tmp + "_"+eval(3*i+j)+"'>\n";
			for(k=0; k<7; k++){
				if(bslist[i][j][k]==""){
					bstable += "<td class='bs0' onclick='setBS(0,1,5)'>&nbsp;</td>\n";
				}else{
					bstable += "<td class='" + tmp2 + j + "' onclick='setBS("+i+","+j+","+k+")' nowrap>" + bslist[i][j][k] + "</td>\n";
				}
			}
			bstable += "</tr>\n";
		}
	}
// alert(bstable);

	bstable += "</table>";

	bstable += "</div></div>";

	document.getElementById("option1").style.height = '650px';
	document.getElementById("option1").style.width = '960px';

	document.getElementById("option2").style.height = '600px';
	document.getElementById("option2").style.width = '860px';
	document.getElementById("option2").style.left = '20px';
	document.getElementById("option2").style.top = '20px';

//	alert(navigator.userAgent);
	if(navigator.userAgent.indexOf('MSIE') > 0 && navigator.userAgent.indexOf('Opera')<0){
		document.getElementById("option1").style.backgroundImage = 'url(data/black.png)';
	}else{
		document.getElementById("option1").style.backgroundImage = 'url(data/alpha.png)';
	}
	document.getElementById("option1").style.filter = "Alpha(opacity=30)";

	document.getElementById("option2").innerHTML = bstable;
}
